Repository: aivve/karbo-woocommerce
Catalog: lang/*.po
Languages: uk

source: Please donate KRB to:
uk: Зробіть пожертву KRB на адресу:

source: to support maintaining of the free Payment Gateway.
uk: для підтримки існування безкоштовного шлюзу.

source: Karbo address is not found in wallet.
uk: Адреса не знайдена в гаманці.

source: Karbo for WooCommerce
uk: Карбованець для WooCommerce

source: Karbo Club Gateway
uk: Платіжний шлюз Карбо Клуб

source: You may send payments from multiple accounts to reach the total required.
uk: Ви можете висилати платежі з різних рахунків поки не назбирається потрібна сума.

source: You must pay in a single payment in full.
uk: Ви мусите зробити оплату однією транзакцією.

source: Karbo Service Provider is not selected
uk: Сервіс провайдер оплати карбованцями не вибрано

source: Please specify Wallet Address in Karbo plugin settings.
uk: Вкажіть адресу карбованців у налаштуваннях плагіну.

source: Karbo Address
uk: Адреса карбованців

source: is invalid. Must be 95 characters long, consisting of digits and letters. You have to register at Karbo.club to get the address.
uk: неправильна. Вона має складатися з 95 символів. Ви повинні зареєстуватись і отримати адресу на Karbo.club.

source: Please send your Karbo payment as follows:
uk: Будь ласка, надішліть свій платіж карбованцями таким чином:

source: Amount
uk: Сума

source: Payment ID:
uk: Ідентифікатор платежу:

source: Address:
uk: Адреса:

source: Open in wallet
uk: Відкрити у гаманці

source: Please note:
uk: Майте на увазі:

source: You must make a payment within 1 hour, or your order will be cancelled
uk: Необхідно здійснити оплату на протязі години, або замовлення буде скасовано

source: As soon as your payment is received in full you will receive email confirmation with order delivery details.
uk: Як тільки платіж буде отримано, вам надійде повідомлення з підтвердженням і деталями.

source: Specific instructions given to the customer to complete Karbos payment.<br />You may change it, but make sure these tags will be present: <b>{{{KRBCOINS_AMOUNT}}}</b>, <b>{{{KRBCOINS_PAYMENTID}}}</b>, <b>{{{KRBCOINS_ADDRESS}}}</b> and <b>{{{EXTRA_INSTRUCTIONS}}}</b> as these tags will be replaced with customer - specific payment details.
uk: Спеціальні вказівки, надані клієнту для завершення платежу карбованцями.<br />Їх можна змінити, але вказівки мають містити ці теги: <b>{{{KRBCOINS_AMOUNT}}}</b>, <b>{{{KRBCOINS_PAYMENTID}}}</b>, <b>{{{KRBCOINS_ADDRESS}}}</b> and <b>{{{EXTRA_INSTRUCTIONS}}}</b> так як замість них будуть підставлені реквізити конкретного платежу.

source: Enable/Disable
uk: Увімкнути/Вимкнути

source: Enable Karbo
uk: Увімунути Карбо

source: Title
uk: Назва

source: This controls the title which the user sees during checkout.
uk: Назва, яка показується на сторінці оплати.

source: Karbo Payment
uk: Оплата карбованцями

source: Your Karbo address where customer sends you payment for the product. It must be received at Karbo.club.
uk: Адреса на яку надходитиме оплата за товари. Ви отримаєте її при реєстрації на Karbo.club.

source: Customer Message
uk: Повідомлення покупцю

source: Initial instructions for the customer at checkout screen
uk: Початкові інструкції для покупця на сторінці оплати

source: Please proceed to the next screen to see necessary payment details.
uk: Перейдіть на наступну сторінку щоб отримати деталі для оплати.

source: Payment Instructions (HTML)
uk: Інструкція по оплаті (HTML)

source: Allows WooCommerce to accept payments in Karbo.
uk: За допомогою цього плагіна у WooCommerce можна приймати оплату в карбованцях.

source: Karbo payment gateway is operational
uk: Шлюз Карбо працює

source: Karbo payment gateway is not operational (try to re-enter and save Karbo Plugin settings):
uk: Шлюз Карбо не працює (спробуйте ще раз ввести і зберегти налаштування):

source: ERROR: Cannot determine Karbo exchange rate. Possible issues: store server does not allow outgoing connections, exchange rate servers are blocking incoming connections or down.
uk: ПОМИЛКА: Не вдалось визначити курс обміну карбованців. Можливі причини: сервер магазину не дозволяє вихідні з’єднання, сервер курсів блокує вхідні з’єднання або недоступний.

source: You may avoid that by setting store currency directly to Karbo (KRB)
uk: Цього можна уникнути якщо встановити Карбованець як основнку валюту магазину.

source: Awaiting Karbo payment to arrive
uk: Очікування оплати карбованцями

source: Karbo
uk: Карбованець

source: Order paid in full
uk: Замовлення повністю оплачене.

source: Order marked as completed according to Karbo plugin settings
uk: Замовлення позначене як завершене згідно з налаштуваннями плагіну Карбо

source: Full payment received for order ID:
uk: Отримано повну оплату замовлення №:

source: Order ID:
uk: Замовлення №:

source: paid in full.
uk: повністю оплачено.

source: Received KRB:
uk: Отримано крб.:

source: Please process and complete order for customer.
uk: Будь-ласка обробіть і виконайте замовлення.

source: Karbo Payment Gateway is NOT operational (try to re-enter and save settings):
uk: Шлюз Карбо Клуб не працює (спробуйте ще раз ввести дані і зберегти налаштування):

source: Karbo Payment Gateway is operational
uk: Шлюз Карбо працює

source: Pending amount:
uk: Очікується сума:

source: Total received:
uk: Всього отримано:

source: Save Changes
uk: Зберегти зміни

source: Reset settings
uk: Скинути налаштування

source: Karbo Service Provider:
uk: Провайдер послуг мережі Карбо:

source: Karbo.Club Payment Gateway
uk: Платіжний шлюз Karbo.Club

source: Please select your Karbo service provider and press [Save changes]. Then fill-in necessary details and press [Save changes] again.
uk: Виберіть провайдера перевірки платежу і натисніть [Зберегти зміни]. Тоді заповніть потрібні поля і натисніть [Зберегти зміни] знову.

source: Wallet Address:
uk: Адреса гаманця:

source: Register at <a href="https://karbo.club/">Karbo Club FREE Gateway</a>, and paste in your wallet address. This plugin works only with addresses registered at Karbo.Club.
uk: Зареєструйтесь на <a href="https://karbo.club/">безкоштовному шлюзі Karbo Club</a> і вставте адресу вашого гаманця. Плагін працює тільки з адресами, отриманими на сервісі Karbo.Club.

source: Number of confirmations required before accepting payment:
uk: Кількість підтверджень для зарахування платежу:

source: After a transaction is broadcast to the Karbo network, it may be included in a block that is published to the network. When that happens it is said that one <b>confirmation</b> has occurred for the transaction. With each subsequent block that is found, the number of confirmations is increased by one. To protect against double spending, a transaction should not be considered as confirmed until a certain number of blocks confirm, or verify that transaction. 6 is considered very safe number of confirmations, although it takes longer to confirm.
uk: Після того як транзакція передається у мережу Карбо, вона потрапляє в блок, кортий публікується в мережі. Коли це стається, транзакція отримує одне <b>підтвердження</b> мережі. З кожним наступним блоком, число підтверджень збільшується на одне. Для захисту від подвійної витрати, транзакція не повинна вважатись підтвердженою доки певна кількість блоків не перевірить і не підтвердить цю транзакцію. 6 підтверджень вважається достатнім, хоча очікування на таку кількість підтверджень може зайняти трохи часу.

source: Payment expiration time (minutes):
uk: Час на виконання оплати (у хвилинах):

source: Payment must get the required number of confirmations within this time.
uk: Платіж має бути зроблений і отримати потрібну кількість підтверджень за цей проміжок.

source: Exchange rate multiplier:
uk: Множник обмінного курсу:

source: Extra multiplier to apply to convert store default currency to Karbo price. <br />Example: 1.05 - will add extra 5% to the total price in Karbos. May be useful to compensate for market volatility or for merchant’s loss to fees when converting Karbos to local currency, or to encourage customer to use Karbos for purchases (by setting multiplier to < 1.00 values).
uk: Додатковий множник при конвертації з валюти магазину по-замовчуванню у ціну в карбованцях. <br />Наприклад: 1.05 - додасть додаткові 5% до ціни у карбованцях. Може знадобитись для компенсації коливань обмінного курсу, або покриття комісій за обмін карбованців на гривні чи іншу валюту, або для того щоб заохотити покупця використати карбованці для оплати (якщо встановити множник у значення < 1.00 вийде знижка).

source: Auto-complete paid orders:
uk: Автоматично позначати завершеними оплачені замовлення:

source: If checked - fully paid order will be marked as “completed” and “<i>Your order is complete</i>” email will be immediately delivered to customer.
uk: Якщо зазначено - повністю оплачене замовлення буде позначене як “завершене”, а покупцю буде негайно надісланий лист “<i>Ваше замовлення звершене</i>”.

source: If unchecked: store admin will need to mark order as completed manually - assuming extra time needed to ship physical product after payment is received.
uk: Якщо ця опція вимкнена: адміністратор повинен вручну позначити замовлення як завершене - у випадку якщо потрібен додатковий час на підготовку доставки після отримання оплати.

source: Note: virtual/downloadable products will automatically complete upon receiving full payment (so this setting does not have effect in this case).
uk: Прим.: замовлення віртуальних товарів і товарів для завантаження будуть автоматично завершуватись після отримання оплати (тобто ці налаштування не мають на них впливу).

source: Cron job type:
uk: Тип завдання Cron:

source: Soft Cron (Wordpress-driven)
uk: Soft Cron (за допомогою Wordpress)

source: Hard Cron (Cpanel-driven)
uk: Hard Cron (за допомогою Cpanel)

source: Hard Cron job is enabled: make sure to follow instructions below to enable hard cron job at your hosting panel.
uk: Hard Cron увімкнено: дотримуйтесь вказівок нижче, щоб задіяти Hard Cron у вашій панелі управління хостингом.

source: Cron job will take care of all regular Karbo payment processing tasks, like checking if payments are made and automatically completing the orders.
uk: Завдання Cron буде регулярно виконувати всі дії по обробці платежів карбованцями, такі як перевірка оплати і автоматичне завершення замовлення.

source: <b>Soft Cron</b>: - Wordpress-driven (runs on behalf of a random site visitor).
uk: <b>Soft Cron</b>: - засобами Wordpress (виконується коли хтось відвідує ваш сайт).

source: <b>Hard Cron</b>: - Cron job driven by the website hosting system/server (usually via CPanel).
uk: <b>Hard Cron</b>: - Завдання Cron виконується у панелі управління хостингу чи сервера (зазвичай у CPanel).

source: When enabling Hard Cron job - make this script to run every 5 minutes at your hosting panel cron job scheduler:
uk: Коли ви вмикаєте завдання Hard Cron - налаштуйте запуск цього скрипта з інтервалом кожні 5 хв. у панелі управління хостингом:

source: <b style="color:red;">NOTE:</b> Cron jobs <b>might not work</b> if your site is password protected with HTTP Basic auth or other methods. This will result in WooCommerce store not seeing received payments (even though funds will arrive correctly to your Karbo addresses).
uk: <b style="color:red;">УВАГА:</b> Завдання Cron <b>можуть не працювати</b> якщо ваш сайт захищений паролем за допомогою HTTP Basic auth або іншими методами. Через це магазин на базі WooCommerce може не бачити отриманих платежів (хоча кошти надійдуть на ваш гаманець у мережі Карбованець).

source: <u>Note:</u> You will need to deactivate/reactivate plugin after changing this setting for it to have effect.
uk: <u>Прим.:</u> Потрібно деактивувати/реактивувати плагін щоб зміна цього налаштування мала ефект.

source: "Hard" cron jobs may not be properly supported by all hosting plans (many shared hosting plans has restrictions in place).
uk: "Hard" завдання cron можуть не підтримуватись у вашому хостингу (багато тарифів shared hosting мають обмеження).

source: Delete all plugin-specific settings, database tables and data on uninstall:
uk: Видалити усі налаштування що стосуються плагіна, таблиці й дані з бази даних при деінсталяції:

source: If checked - all plugin-specific settings, database tables and data will be removed from Wordpress database upon plugin uninstall (but not upon deactivation or upgrade).
uk: Якщо зазначити - усі налаштування плагіна, записи і таблиці будуть видалені з бази даних Wordpress при деінсталяції цього плагіна (але не при деактивації чи оновленні).

source: According to your settings (including multiplier), current calculated rate for 1 Karbo (in
uk: Відповідно до ваших налаштувань (включно з множником), поточний курс 1 крб. (в

source: is
uk: становить

source: WARNING: Cannot determine exchange rates (for
uk: УВАГА: Не вдалось отримати курси обміну (для

source: Make sure your PHP settings are configured properly and your server can (is allowed to) connect to external WEB services via PHP.
uk: Переконайтесь, що PHP налаштовано вірно і ваш сервер може підключатись до зовнішніх веб-сервісів через PHP.

source: The following PHP functions are disabled on your server:
uk: На вашому сервері відключені ці функції PHP:

source: is invalid. Must be 95 characters long, consisting of digits and letters.
uk: неправильна. Вона має складатись із 95 букв і цифр.

source: ERROR: Cannot determine exchange rates (for
uk: ПОМИЛКА: Не вдалось визначити курси обміну (для

source: Once every 30 seconds
uk: Раз на 30 секунд

source: Once every 1 minute
uk: Раз в хвилину

source: Once every 2.5 minutes
uk: Раз на 2.5 хв.

source: Once every 5 minutes
uk: Кожні 5 хв.

source: Woo Karbo Club
uk: Woo Карбо Клуб

source: Karbo Club
uk: Карбо Клуб

source: WooCommerce Karbo Club Gateway
uk: Шлюз Карбо Клуб для WooCommerce

source: General Settings
uk: Загальні налаштування
